###############################################################################
# Created by write_sdc
###############################################################################
current_design sar_controller
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 50.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_comp_n}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {out_comp_p}]
set_input_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {clk_comp}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_n[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dac_p[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[0]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[1]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[2]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[3]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[4]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[5]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[6]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[7]}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {eoc}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {phi_sample}]
set_output_delay 10.0000 -clock [get_clocks {clk}] -add_delay [get_ports {phi_sample_n}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {clk_comp}]
set_load -pin_load 0.0334 [get_ports {eoc}]
set_load -pin_load 0.0334 [get_ports {phi_sample}]
set_load -pin_load 0.0334 [get_ports {phi_sample_n}]
set_load -pin_load 0.0334 [get_ports {dac_n[7]}]
set_load -pin_load 0.0334 [get_ports {dac_n[6]}]
set_load -pin_load 0.0334 [get_ports {dac_n[5]}]
set_load -pin_load 0.0334 [get_ports {dac_n[4]}]
set_load -pin_load 0.0334 [get_ports {dac_n[3]}]
set_load -pin_load 0.0334 [get_ports {dac_n[2]}]
set_load -pin_load 0.0334 [get_ports {dac_n[1]}]
set_load -pin_load 0.0334 [get_ports {dac_n[0]}]
set_load -pin_load 0.0334 [get_ports {dac_p[7]}]
set_load -pin_load 0.0334 [get_ports {dac_p[6]}]
set_load -pin_load 0.0334 [get_ports {dac_p[5]}]
set_load -pin_load 0.0334 [get_ports {dac_p[4]}]
set_load -pin_load 0.0334 [get_ports {dac_p[3]}]
set_load -pin_load 0.0334 [get_ports {dac_p[2]}]
set_load -pin_load 0.0334 [get_ports {dac_p[1]}]
set_load -pin_load 0.0334 [get_ports {dac_p[0]}]
set_load -pin_load 0.0334 [get_ports {dout[7]}]
set_load -pin_load 0.0334 [get_ports {dout[6]}]
set_load -pin_load 0.0334 [get_ports {dout[5]}]
set_load -pin_load 0.0334 [get_ports {dout[4]}]
set_load -pin_load 0.0334 [get_ports {dout[3]}]
set_load -pin_load 0.0334 [get_ports {dout[2]}]
set_load -pin_load 0.0334 [get_ports {dout[1]}]
set_load -pin_load 0.0334 [get_ports {dout[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {out_comp_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {out_comp_p}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
